CSI API ETABS v1
cFrameObj.SetDesignProcedure Method
 Sets the design procedure for frame objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDesignProcedure(
	string Name,
	int MyType,
	eItemType ItemType = eItemType.Objects
)
Function SetDesignProcedure (
	Name As String,
	MyType As Integer,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetDesignProcedure(Name,
	MyType, ItemType)
int SetDesignProcedure(
	String^ Name,
	int MyType,
	eItemType ItemType = eItemType::Objects
)
abstract SetDesignProcedure :
        Name : string *
        MyType : int *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
MyType
Type: System.Int32
 This is an integer from the list below, indicating the design procedure type desired for the specified frame object.
Program determined = 0
Steel Frame Design = 1
Concrete Frame Design = 2
Composite Beam Design = 3
Steel Joist Design = 4
No Design = 7
Composite Column Design = 13
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the design procedure is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set design procedure
   ret = SapModel.FrameObj.SetDesignProcedure("8", 3)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace